app/views/pages/_form.html.erb

        <th>Subject</th>
        <td><%= f.select(:subject, 1..@subject_count) %></td>
---
SELECT COUNT(*) FROM `subjects`