app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC
---
	def list
		@pages = Page.order("pages.position ASC")