app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`subject_id` = 1 ORDER BY pages.position ASC
---
  def list
    @pages = Page.sorted.where(:subject_id => @subject.id)

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
---
  def show
    @page = Page.find(params[:id])

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 1
SELECT `pages`.* FROM `pages`
SELECT `subjects`.* FROM `subjects` ORDER BY position ASC
---
  def new
    @page = Page.new(:subject_id => @subject.id)
    @page_count = @subject.pages.size + 1
    @subjects = Subject.order('position ASC')

INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`, `visible`) VALUES ('2012-05-01 00:41:36', NULL, NULL, NULL, NULL, '2012-05-01 00:41:36', 0)
SELECT COUNT(*) FROM `pages`
---
  def create
    # Instantiate a new object using form parameters
    @page = Page.new(params[:page])
    # Save the object
    if @page.save
      # If save succeeds, redirect to the list action
      flash[:notice] = "Page created."
      redirect_to(:action => 'list', :subject_id => @page.subject_id)
    else
      # If save fails, redisplay the form so user can fix problems
      @page_count = @subject.pages.size + 1

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1
SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 5
SELECT `subjects`.* FROM `subjects` ORDER BY position ASC
---
  def edit
    @page = Page.find(params[:id])
    @page_count = @subject.pages.size
    @subjects = Subject.order('position ASC')

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1
UPDATE `pages` SET `name` = 'Page 83', `position` = 43, `updated_at` = '2012-05-01 01:28:58' WHERE `pages`.`id` = 3
---
  def update
    # Find object using form parameters
    @page = Page.find(params[:id])
    # Update the object
    if @page.update_attributes(params[:page])

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
---
  def delete
    @page = Page.find(params[:id])

DELETE FROM `pages` WHERE `pages`.`id` = 5
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
---
  def destroy
    Page.find(params[:id]).destroy

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def find_subject
    if params[:subject_id]
      @subject = Subject.find_by_id(params[:subject_id])