app/controllers/public_controller.rb

  def show
  	@page = Page.where(:permalink => params[:id], :visible => true).first
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`permalink` = 'firstpage' AND `pages`.`visible` = 1 LIMIT 1