app/controllers/sections_controller.rb

  def list
    @sections = Section.sorted.where(:page_id => @page.id)
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`page_id` IS NULL ORDER BY sections.position ASC

  def show
    @section = Section.find(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def new
    @section = Section.new(:page_id => @page.id)
    @section_count = @page.sections.size + 1
    @pages = Page.order('position ASC')
---
SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 1
SELECT COUNT(*) FROM `pages`
SELECT `pages`.* FROM `pages` ORDER BY position ASC

  def create
    @section = Section.new(params[:section])
    if @section.save
      flash[:notice] = "Section created."
      redirect_to(:action => 'list', :page_id => @section.page_id)
    else
      @section_count = @page.sections.size + 1
---
INSERT INTO `sections` (`content`, `content_type`, `created_at`, `name`, `page_id`, `position`, `updated_at`, `visible`) VALUES ('This is Section Seventy', 'Text', '2012-05-01 00:53:31', 'Section 70', NULL, 70, '2012-05-01 00:53:31', NULL)
SELECT COUNT(*) FROM `sections`

  def edit
    @section = Section.find(params[:id])
    @section_count = @page.sections.size
    @pages = Page.order('position ASC')
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 1
SELECT COUNT(*) FROM `pages`
SELECT `pages`.* FROM `pages` ORDER BY position ASC

  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])
      flash[:notice] = "Section updated."
      redirect_to(:action => 'show', :id => @section.id, :page_id => @section.page_id)
    else
      @section_count = @page.sections.size
      @pages = Page.order('position ASC')
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 4 LIMIT 1
UPDATE `sections` SET `visible` = 1, `content_type` = 'text', `content` = 'This is sample content.', `updated_at` = '2012-05-08 23:11:49' WHERE `sections`.`id` = 1
SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 1
SELECT `pages`.* FROM `pages` ORDER BY position ASC

  def delete
    @section = Section.find(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 4 LIMIT 1

  def destroy
    Section.find(params[:id]).destroy
---
DELETE FROM `sections` WHERE `sections`.`id` = 4
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 4 LIMIT 1

  def find_page
    if params[:page_id]
      @page = Page.find_by_id(params[:page_id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1