app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
  def list
    @subjects = Subject.order("subjects.position ASC")

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` IS NULL LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1

INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2012-05-01 00:38:23', 'Subject 4', 5, '2012-05-01 00:38:23', 0)
SELECT COUNT(*) FROM `subjects`
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(params[:subject])
    # Save the object
    if @subject.save
      # If save succeeds, redirect to the list action
      flash[:notice] = "Subject created."
      redirect_to(:action => 'list')
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count + 1

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `subjects`
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` IS NULL LIMIT 1
UPDATE `subjects` SET `visible` = 1, `created_at` = '2012-05-01 00:38:00', `updated_at` = '2012-05-09 00:09:26' WHERE `subjects`.`id` = 5
---
  def update
    # Find object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(params[:subject])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

DELETE FROM `subjects` WHERE `subjects`.`id` = 4
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
---
  def destroy
    Subject.find(params[:id]).destroy